Dlubal.RFEM5.LineType
Type of line

Dlubal.RFEM5.LineType.UnknownLineType
Unknown line

Dlubal.RFEM5.LineType.PolylineType
Polyline

Dlubal.RFEM5.LineType.SplineType
Spline

Dlubal.RFEM5.LineType.CircleType
Circle

Dlubal.RFEM5.LineType.ArcType
Arc

Dlubal.RFEM5.LineType.BSplineType
B-Spline

Dlubal.RFEM5.LineType.BezierSplineType
Bezier-Spline

Dlubal.RFEM5.LineType.IntersectionType
Intersection

Dlubal.RFEM5.LineType.TrajectoryType
Trajectory

Dlubal.RFEM5.LineType.OnSurfaceType
On Surface

Dlubal.RFEM5.LineType.EllipseType
Ellipse

Dlubal.RFEM5.LineType.EllipticalArcType
Elliptical Arc

Dlubal.RFEM5.LineType.ParabolaType
Parabola

Dlubal.RFEM5.LineType.HyperbolaType
Hyperbola

Dlubal.RFEM5.LineType.NurbSplineType
NURBS

Dlubal.RFEM5.LineType.CopyType
Copy line